# Agricultural investments made by various regions and sectors

### This notebook is going to show agricultural investments and land acquisitions into different sectors made by various countries lands.

# Loading data CSV and libraries

First, the required libraries are shown. We are going to use matplotlib for plotting library.  We are loading the data using pandas read_csv function. The data has 416 observations in 9 columns.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

df = pd.read_csv('GRAIN---Land-grab-deals---Jan-2012.csv', sep=';', decimal=',')
df.shape

(416, 9)

# Sample the data

To get an impression of the data and have a look at the features, we firstly use the command .info().

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 416 entries, 0 to 415
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Landgrabbed           416 non-null    object
 1   Landgrabber           416 non-null    object
 2   Base                  416 non-null    object
 3   Sector                406 non-null    object
 4   Hectares              414 non-null    object
 5   Production            382 non-null    object
 6   Projected investment  106 non-null    object
 7   Status of deal        416 non-null    object
 8   Summary               416 non-null    object
dtypes: object(9)
memory usage: 29.4+ KB

In order to check if there are any null values we use .isna() command

In [3]:
df.isna().sum()

Landgrabbed               0
Landgrabber               0
Base                      0
Sector                   10
Hectares                  2
Production               34
Projected investment    310
Status of deal            0
Summary                   0
dtype: int64

Here is a sample of the data and more especially the first 5 results which are taken from the data set to see what kind of values we have.

In [4]:
df.head()

,Landgrabbed,Landgrabber,Base,Sector,Hectares,Production,Projected investment,Status of deal,Summary
0,Algeria,Al Qudra,UAE,"Finance, real estate",31000.0,"Milk, olive oil, potatoes",NaN,Done,Al Qudra Holding is a joint-stock company esta...
1,Angola,CAMC Engineering Co. Ltd,China,Construction,1500.0,Rice,US$77 million,Done,CAMCE is a subsidiary of the China National Ma...
2,Angola,ENI,Italy,Energy,12000.0,Oil palm,NaN,In process,The project is a joint venture between Sonango...
3,Angola,AfriAgro,Portugal,"Finance, real estate",5000.0,Oil palm,US$30-35 million,Done,AfriAgro is a subsidiary of the Portugal-based...
4,Angola,Eurico Ferreira,Portugal,"Energy, telecommunications\n",30000.0,Sugar cane,US$200 million,Done,"In 2008, Portuguese conglomerate Eurico Ferrei..."

Using the .describe() function computes a summary of statistics pertaining the dataFrame columns. Sector column categorizes each investment inot specific agricultural sector, hectares columns the land area, production the type of agricultural product.

In [5]:
df.describe()

,Landgrabbed,Landgrabber,Base,Sector,Hectares,Production,Projected investment,Status of deal,Summary
count,416,416,416,406,414,382,106,416,416
unique,71,308,63,27,220,182,89,10,401
top,Mozambique,Foras International Investment Co,US,Agribusiness,10000.0,Oil palm,US$250 million,Done,Germanagrar is a German company based in Hambu...
freq,24,6,40,199,32,40,3,324,4

.value_counts() is a command in pandas that returns a series containg counts of unique values. The results are in descending order so that means that Landgrabbed is the most frequently occuring element.

In [6]:
df.Landgrabbed.value_counts()

Landgrabbed
Mozambique    24
Australia     22
Brazil        22
Ethiopia      21
Russia        19
              ..
China          1
Burma          1
Brazil         1
Argentina      1
Zimbabawe      1
Name: count, Length: 71, dtype: int64

As we can see from this example in here, our dataset is not proeprly cleaned since it sometimes has duplicated values (For example Agribusiness).

In [7]:
df['Sector'].head(50)

0             Finance, real estate
1                     Construction
2                           Energy
3             Finance, real estate
4     Energy, telecommunications\n
5             Agribusiness, energy
6                     Agribusiness
7                     Agribusiness
8                     Agribusiness
9                          Finance
10                    Agribusiness
11                         Finance
12                         Finance
13                         Finance
14                         Finance
15                      Industrial
16                    Agribusiness
17                    Agribusiness
18                    Agribusiness
19                      Government
20                    Agribusiness
21                    Agribusiness
22                    Agribusiness
23                         Finance
24                         Finance
25                    Agribusiness
26                             NaN
27       Industrial, real estate\n
28                    Construction
29                    Agribusiness
30                         Finance
31                         Finance
32                         Finance
33                    Agribusiness
34                    Agribusiness
35                      Industrial
36                         Finance
37                    Agribusiness
38                         Finance
39                         Finance
40                         Finance
41                         Finance
42                         Finance
43                         Finance
44                             NaN
45    Agribusiness, construction\n
46                         Finance
47                             NaN
48                          Energy
49                    Agribusiness
Name: Sector, dtype: object

# Clean data

If we want to take the first step to clean the data, we need to split the values using the split() command. We are going to seperate the values in the Sector column of our DatFrame by a comma and expand the results into seperate columns.

In [8]:
subset = df['Sector'].str.split(',', expand = True)
subset.head(10)

              0                      1     2
0       Finance            real estate  None
1  Construction                   None  None
2        Energy                   None  None
3       Finance            real estate  None
4        Energy   telecommunications\n  None
5  Agribusiness                 energy  None
6  Agribusiness                   None  None
7  Agribusiness                   None  None
8  Agribusiness                   None  None
9       Finance                   None  None

As we split the values, we can now put the values in the dataFrame with names sector 1, 2 and 3. As result we have our new columns but we now need to delete the original Sector column. 
Here is how our dataframe looks like now.

In [9]:
df[['sector1', 'sector2', 'sector3']] = df['Sector'].str.split(',', expand = True)
df.drop('Sector', axis='columns', inplace=True)
df.head()

,Landgrabbed,Landgrabber,Base,Hectares,Production,Projected investment,Status of deal,Summary,sector1,sector2,sector3
0,Algeria,Al Qudra,UAE,31000.0,"Milk, olive oil, potatoes",NaN,Done,Al Qudra Holding is a joint-stock company esta...,Finance,real estate,None
1,Angola,CAMC Engineering Co. Ltd,China,1500.0,Rice,US$77 million,Done,CAMCE is a subsidiary of the China National Ma...,Construction,None,None
2,Angola,ENI,Italy,12000.0,Oil palm,NaN,In process,The project is a joint venture between Sonango...,Energy,None,None
3,Angola,AfriAgro,Portugal,5000.0,Oil palm,US$30-35 million,Done,AfriAgro is a subsidiary of the Portugal-based...,Finance,real estate,None
4,Angola,Eurico Ferreira,Portugal,30000.0,Sugar cane,US$200 million,Done,"In 2008, Portuguese conglomerate Eurico Ferrei...",Energy,telecommunications\n,None

The following piece of code is used to obtain the unique values which are present in Status of deal column as an array. From the result, we can conclude that our column contains some duplications. (Suspended and done)

In [10]:
df['Status of deal'].unique()

array(['Done', 'Done ', 'In process', 'Done (50-yr lease)', 'Suspended',
       'Proposed', 'MoU signed (2009)', 'Done\n', 'Suspended  ',
       'Suspended (October 2011)'], dtype=object)

We are going to perform two more actions so our data gets more clean. .str.strip() removes leading and trailing whitespaces from the vlaues in "Status of deal" colum. .unique() -retrieves the unique values which are presnt in the column and is going to return an array.

In [11]:
df['Status of deal'] = df['Status of deal'].str.strip()
df['Status of deal'].unique()

array(['Done', 'In process', 'Done (50-yr lease)', 'Suspended',
       'Proposed', 'MoU signed (2009)', 'Suspended (October 2011)'],
      dtype=object)

.duplicated is a function that checks for duplicated rows and returns a boolean and after we put .value_counts() is giving us the occurences of each unique value in the series which are true and false. The result is False 416 so we can conclude that ther are 416 non-duplicate rows in our dataframe.

In [12]:
df.duplicated().value_counts()

False    416
Name: count, dtype: int64

Another issue that our dataset is the Projected investment columng which has values like "70 million,35 million", which are numbers but not actual numbers. We are going to use the .replace command  and .extract() which extract the numeric portion from the string.

In [13]:
df['Projected Investment (US$ millions)'] = df['Projected investment'].str.replace('US$', '').str.extract('(\d+\.?\d*)').astype(float)
df

,Landgrabbed,Landgrabber,Base,Hectares,Production,Projected investment,Status of deal,Summary,sector1,sector2,sector3,Projected Investment (US$ millions)
0,Algeria,Al Qudra,UAE,31000.0,"Milk, olive oil, potatoes",NaN,Done,Al Qudra Holding is a joint-stock company esta...,Finance,real estate,None,NaN
1,Angola,CAMC Engineering Co. Ltd,China,1500.0,Rice,US$77 million,Done,CAMCE is a subsidiary of the China National Ma...,Construction,None,None,77.0
2,Angola,ENI,Italy,12000.0,Oil palm,NaN,In process,The project is a joint venture between Sonango...,Energy,None,None,NaN
3,Angola,AfriAgro,Portugal,5000.0,Oil palm,US$30-35 million,Done,AfriAgro is a subsidiary of the Portugal-based...,Finance,real estate,None,30.0
4,Angola,Eurico Ferreira,Portugal,30000.0,Sugar cane,US$200 million,Done,"In 2008, Portuguese conglomerate Eurico Ferrei...",Energy,telecommunications\n,None,200.0
...,...,...,...,...,...,...,...,...,...,...,...,...
411,Zambia,Export Trading Group,Singapore,57000.0,"Food crops, jatropha",NaN,Done,"ETG, owned by Kenya's Patel family, is incorpo...",Agribusiness,None,None,NaN
412,Zambia,AG-ZAM,South Africa,15000.0,Sugar cane,US$251 million,Done,In April 2011 the Zambia Development Agency an...,Agribusiness,None,None,251.0
413,Zambia,Chayton Capital,UK,20000.0,Crops,US$85 million,Done,Chayton Capital is a US$300-million London-bas...,Finance,None,None,85.0
414,Zambia,Emvest,UK,2513.0,"Banana, maize, wheat",NaN,Done,UK private equity firm Emergent Asset Manageme...,Finance,None,None,NaN
415,Zimbabawe,Emvest,UK,9913.0,NaN,NaN,Done,UK private equity firm Emergent Asset Manageme...,Finance,None,None,NaN

# Conclusion

From the previous examples, we can conclude that several rules can be deduced. Format of numeric values: 34 millions US. For this example we could even make another columns which are going to present the min and max values, since we had examples varying like 30-35 millions, but in here I decided to take the mean. In order to find exceptions for this rule specifically , we could firstly examine the data manually, another way is to visualize the data. (histogram, plots). By cleaning the data, there could be vsrious consequences like: making assumptions such as mean values would not be accurate. Cleaning data makes it more suitable for analysis